var a, x,y,z,k,l,m:integer;
s, t, r:string;
begin
readln(a);
k:=a div 100000;
l:=(a div 10000)mod 10;
m:=(a div 1000)mod 10;
x:=(a div 100)mod 10;
y:=(a div 10)mod 10;
z:=a mod 10;
writeln(k, l, m, x, y, z);
if y=1 then
  r:='рублей'
else
  if z=1 then
    r:='рубль'
  else
    if (z>=2)and(z<=4) then
      r:='рубля'
    else
      r:='рублей';
if (m>=5)and(m<=9)or(l=1) then
  t:='тысяч '
else
  if(m>=2)and(m<=4) then
      t:='тысячи '
  else
    if m=1 then
      t:='тысяча ';
case k of
  0:s:='';
  1:s:='Cто ';
  2:s:='Двести ';
  3:s:='Триста ';
  4:s:='Четыреста ';
  5:s:='Пятьсот ';
  6:s:='Шестьсот ';
  7:s:='Семьсот ';
  8:s:='Восемьсот ';
  9:s:='Девятьсот ';
end;
  if l<>1 then
    begin
    case l of
      0:s:=s+'';
      2:s:=s+'двадцать ';
      3:s:=s+'тридцать ';
      4:s:=s+'сорок ';
      5:s:=s+'полста ';
      6:s:=s+'шестьдесят ';
      7:s:=s+'семьдесят ';
      8:s:=s+'восемьдесят ';
      9:s:=s+'девяносто ';
end;
    case m of
    0:s:=s+'';
    1:s:=s+'одна '+t;
    2:s:=s+'дв3 '+t;
    3:s:=s+'три '+t;
    4:s:=s+'четыре '+t;
    5:s:=s+'пять '+t;
    6:s:=s+'шесть '+t;
    7:s:=s+'семь '+t;
    8:s:=s+'восемь '+t;
    9:s:=s+'девять '+t;
    end;
    end
  else
    case m of
    0:s:=s+'десять'+t;
    1:s:=s+'одиннадцать '+t;
    2:s:=s+'двенадцать '+t;
    3:s:=s+'тринадцать '+t;
    4:s:=s+'четырнадцать '+t;
    5:s:=s+'пятнадцать '+t;
    6:s:=s+'шестнадцать '+t;
    7:s:=s+'семнадцать '+t;
    8:s:=s+'восемнадцать '+t;
    9:s:=s+'девятнадцать '+t;
    end;
case x of
  0:s:=s+'';
  1:s:=s+'сто ';
  2:s:=s+'двести ';
  3:s:=s+'триста ';
  4:s:=s+'четыреста ';
  5:s:=s+'пятьсот ';
  6:s:=s+'шестьсот ';
  7:s:=s+'семьсот ';
  8:s:=s+'восемьсот ';
  9:s:=s+'девятьсот ';
end;
  if y<>1 then
    begin
    case y of
      0:s:=s+'';
      2:s:=s+'двадцать ';
      3:s:=s+'тридцать ';
      4:s:=s+'сорок ';
      5:s:=s+'полста ';
      6:s:=s+'шестьдесят ';
      7:s:=s+'семьдесят ';
      8:s:=s+'восемьдесят ';
      9:s:=s+'девяносто ';
end;
    case z of
    0:s:=s+'';
    1:s:=s+'один '+r;
    2:s:=s+'два '+r;
    3:s:=s+'три '+r;
    4:s:=s+'четыре '+r;
    5:s:=s+'пять '+r;
    6:s:=s+'шесть '+r;
    7:s:=s+'семь '+r;
    8:s:=s+'восемь '+r;
    9:s:=s+'девять '+r;
    end;
    end
  else
    case z of
    0:s:=s+'десять'+r;
    1:s:=s+'одиннадцать '+r;
    2:s:=s+'двенадцать '+r;
    3:s:=s+'тринадцать '+r;
    4:s:=s+'четырнадцать '+r;
    5:s:=s+'пятнадцать '+r;
    6:s:=s+'шестнадцать '+r;
    7:s:=s+'семнадцать '+r;
    8:s:=s+'восемнадцать '+r;
    9:s:=s+'девятнадцать '+r;
    end;
    writeln(s);
end.
